[
  {
    "id": 1,
    "postedAt": "2022-11-22",
    "title": "Atualização de The Witcher 3",
    "content": "Publicação em andamento...",
    "author": "Luiz Gustavo",
    "authorImage": "../../assets/images/creators/luiz.jpg",
    "views": 0,
    "likes": 0
  },
  {
    "id": 2,
    "postedAt": "2022-11-23",
    "title": "Principais dicas de Warzone 2.0",
    "content": "Publicação em andamento...",
    "author": "Nando Brandão",
    "authorImage": "../../assets/images/creators/lucas.jpg",
    "views": 0,
    "likes": 0
  },
  {
    "id": 3,
    "postedAt": "2022-11-25",
    "title": "Dicas de sobrevicência no Project Zombloid",
    "content": "Publicação em andamento...",
    "author": "Nando Brandão",
    "contentHeader": "../../assets/images/posts/2/header.jpg",
    "authorImage": "../../assets/images/creators/lucas.jpg",
    "views": 0,
    "likes": 0
  },
  {
    "id": 4,
    "postedAt": "2022-11-30",
    "title": "Ryzen X Intel: Qual compensa nos dias atuais?",
    "content": "Publicação em andamento...",
    "author": "Diogo Shikuma",
    "contentHeader": "../../assets/images/posts/3/header.jpg",
    "authorImage": "../../assets/images/creators/diogo.jpg",
    "views": 0,
    "likes": 0
  },
  {
    "id": 5,
    "postedAt": "2022-12-01",
    "title": "Expectativas para Street Figher VI",
    "content": "<h4 class='subtitle'>Street Fighter VI está definindo o novo padrão do gênero de jogos de luta.</h4><p>Do visual impactante ao modo história ambicioso, dos personagens cheios de personalidade e as mecânicas cuidadosamente delineadas, dá abundância de possibilidades para jogadores tanto competitivos quanto aos mais casuais. O ST6 está acertando em cada um desses detalhes.</p><p>A Capcom parece estar mais confiante com tudo o que vem demonstrando ao público, pois parece ter aprendido com seus erros no passado, com o tão conturbado lançamento de ST5.</p><p>(Problemas com falta de conteúdo, não foi lançado junto com um modo história, atraso no lançamento de DLC's, sem modo arcade).</p><p>Já podemos ver que o novo jogo da série irá trazer uma nova mecânica de gameplay, com o nome de “World Tour”. É um novo tipo de modo história ambicioso e totalmente inédita para a franquia e o melhor, é um modo pensado para todos os jogadores.</p><p>A criação de avatares é a parte que mais chamou atenção da internet. Com combinações praticamente infinitas, é possível para o jogador escolher customizar o seu personagem de uma forma mais descolada ou deixar uma forma mais padrão, ou ir ao extremo e criar as piores aberrações já vistas na terra.</p><p>Algo novo implementado também, em questão de acessibilidade, são os “Modern Controls” (botões de atalho para execução) que facilita a entrada de novos jogadores ou para pessoas que não queiram ficar horas decorando os botões para conseguir utilizar um “hadouken”.</p><p>Se estiver com saudades e nostálgico, poderá conferir O Street Fighter II ou Final Fight (dentre outros jogos da época) em uma sessão de fliperamas do próprio game.</p><p>Jogo de luta não precisa ser apenas sobre competir e se tornar o próximo grande campeão do mundo competitivo. O gênero visa também a diversão, e diversão é para todo mundo. E baseado na versão beta disponibilizada para testes, podemos notar um grande carinho na produção por parte da Capcom.</p><p>Enquanto no lançamento do jogo anterior da série não possuir conteúdo para manter os jogares por alguns dias, a versão beta de ST6 mostrou ter conteúdo o suficiente para manter as pessoas entretidas por semanas e até meses. Por isso é impressionante ver a quantidade de opções que foi mostrada para o público e o potencial do jogo como um todo apenas na versão de testes dele.</p>",
    "author": "Diogo Shikuma",
    "contentHeader": "../../assets/images/posts/1/header.jpg",
    "authorImage": "../../assets/images/creators/diogo.jpg",
    "instagramPost": "https://www.instagram.com/p/Cl1HVjegH-g/",
    "views": 0,
    "likes": 0
  }
]
